Диплом/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СЕК_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СЕК_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СЕК_СуммаЕжемесячнойАбоненсткойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СЕК_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>СЕК_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/Catalogs/ДоговорыКонтрагентов/Forms/СЕК_ФормаЭлемента/Module.bsl
// {{ СЕК 16.03.24 Добавление в форму новых реквизитов в зависиости от Выбора в Виде договоров "Абонентское обслуживание" 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ОпределитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОпределитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидимостьЭлементов()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СЕК_АбонентскоеОбслуживание") Тогда
		
		Элементы.СЕК_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.СЕК_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.СЕК_СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
		Элементы.СЕК_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Истина;
	Иначе
		Объект.СЕК_ДатаНачалаДействияДоговора = Неопределено;
		Объект.СЕК_ДатаОкончанияДействияДоговора = Неопределено;
		Объект.СЕК_СтоимостьЧасаРаботыСпециалиста = Неопределено;
		Объект.СЕК_СуммаЕжемесячнойАбоненсткойПлаты = Неопределено;
		Элементы.СЕК_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.СЕК_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.СЕК_СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		Элементы.СЕК_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// СЕК 16.03.24 Конец добавления }}
